<a href="https://colab.research.google.com/github/TMTucker1/DAS511/blob/main/Copy_of_Pandas_Fundamentals.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introduction

Pandas is a Python module that provides capabilities to interact-with and to manipulate data that is structured as rows and columns. This is a very common way to structure data. Often rows are used to represent things like transactions or observations and columns are used to represent attributes or measurements of these things. Record sets from SQL database queries are structured this way; CSV files are also structured this way; Microsoft Excel's spreadsheets often store data in rows and columns table as well. Pandas provides many features to support loading this data from these types of sources or from regular Python list or dict objects. Once the Pandas loads the data, Pandas provides numerous features to conduct data analysis.

# Installation

Pandas often comes bundled within scientific Python distributions such as Anaconda. If your Python distribution does not come with Pandas, you can install Pandas using the Python package installer **pip**. First ensure you activate the Python virtual environment you are using to perform data analysis (for more details about Python virtual environments see https://docs.python.org/3/tutorial/venv.html). Then run the following command from the command line:

```console
pip install pandas
```

For more help see check out https://pandas.pydata.org/pandas-docs/stable/getting_started/install.html.

## Importing pandas

Often Pandas is imported with the name **pd** to reference the module.

In [ ]:
import pandas as pd

# Retrieving Data

## Retrieving Data within a CSV File

In [ ]:
df_housing = pd.read_csv("sample_data/california_housing_test.csv")

# display first couple rows
df_housing.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

## Retrieving Data within a SQL Database

In [ ]:
import sqlite3
 
with sqlite3.connect('/content/population.db') as db_con:
  query = "SELECT country, population FROM Population;"

  df_countries = pd.read_sql_query(query, db_con)

# display first couple rows
df_countries.head()

DatabaseError: ignored

## Retrieving Data within a HTML File

In [ ]:
tables = pd.read_html('https://en.wikipedia.org/wiki/Minnesota', match='Election results from statewide races')

# get first dataframe extracted from html
df_table_MN = tables[0]

# display first couple rows
df_table_MN.head()

   Year     Office    GOP    DFL Others
0  2020  President  45.3%  52.4%   2.3%
1  2020    Senator  43.5%  48.8%   7.7%
2  2018   Governor  42.4%  53.9%   3.7%
3  2018    Senator  36.2%  60.3%   3.4%
4  2018    Senator  42.4%  53.0%   4.6%

# Creating DataFrames Manually

The examples above loaded data into a Pandas DataFrame. If your Python code has the data already in memory, code can be used to load it directly into a Pandas DataFrame.

## Creating a DataFrame with a Column dict

In [ ]:
data_as_column_map = {
    "name": ["Bob","Mary","Roy","John","Susie"],
    "age": [12,39,59,53,16]
}
df_people = pd.DataFrame(data_as_column_map)

# display first couple rows
df_people.head()

    name  age
0    Bob   12
1   Mary   39
2    Roy   59
3   John   53
4  Susie   16

## Creating a DataFrame with a list of Rows

In [ ]:
data_as_rows = [["Bob", 12], ["Mary",39], ["Roy", 59], ["John", 53], ["Susie", 16]]

df_people = pd.DataFrame(columns=["name","age"], data=data_as_rows)

# display first couple rows
df_people.head()

    name  age
0    Bob   12
1   Mary   39
2    Roy   59
3   John   53
4  Susie   16

# DataFrame Structure

[Series](https://pandas.pydata.org/docs/reference/api/pandas.Series.html) objects are used to represent single dimension data, for instance a single column of data or a single row of data.

[DataFrame](https://pandas.pydata.org/docs/reference/frame.html) objects are used to represent multiple rows and columns of data.

In [ ]:
print(f"df_people is an instance of {type(df_people)}")
print("")
print(f"Every dataframe has a row index, for instance df_people's row index is  {df_people.index}. This index provides a means to uniquely locate rows.")
print("")
print(f"Every dataframe has a column index, for instance df_people's column index is  {df_people.columns}. This index provides a means to uniquely locate columns.")
print("")

df_people is an instance of <class 'pandas.core.frame.DataFrame'>

Every dataframe has a row index, for instance df_people's row index is  RangeIndex(start=0, stop=5, step=1). The index that provides a means to uniquely locate rows.

Every dataframe has a column index, for instance df_people's column index is  Index(['name', 'age'], dtype='object'). The index that provides a means to uniquely locate columns.

# Accessing Data in a DataFrame

## Accessing Columns in a DataFrame

In [ ]:
s_name = df_people["name"]

print(f"Use the square brackets to retrive column data; for instance the column name is an instance of {type(s_name)}")
print("")
# display first couple data points in column
s_name.head()

Use the square brackets to retrive column data; for instance the column name is an instance of <class 'pandas.core.series.Series'>

0      Bob
1     Mary
2      Roy
3     John
4    Susie
Name: name, dtype: object

In [ ]:
# You can also access the column Series objects using the dot attribute notation
s_name = df_people.name

s_name

0      Bob
1     Mary
2      Roy
3     John
4    Susie
Name: name, dtype: object

In [ ]:
# notice even Series objects have an index, in this case, based on the row index

# we can select a row data point use the index with brackets
s_name[0]

'Bob'

## Accessing Rows in a DataFrame

In [ ]:
s_row_1 = df_people.loc[0]

print(f"Use loc to select a specific row; for instance row 0 is an instance of {type(s_row_1)}")
print("")

# display data in row
s_row_1

Use loc to select a specific row; for instance row 0 is an instance of <class 'pandas.core.series.Series'>

name    Bob
age      12
Name: 0, dtype: object

In [ ]:
# notice the row Series index object is based on the columns

# we can select a column use the index with brackets
s_row_1["name"]

'Bob'

## Accessing Data by Index

In [ ]:
# sometimes we want a Series within a dataframe based on the order within the index, we use iloc to do this
s_row_1_using_order = df_people.iloc[0]

s_row_1_using_order

name    Bob
age      12
Name: 0, dtype: object

In [ ]:
# also works for a row based series index
s_row_1.iloc[0]

'Bob'

In [ ]:
# In the case the above, this is the same as below
s_row_1.loc["name"]

'Bob'

## Iterating over the Rows in a DataFrame

In [ ]:
for s_row in df_people.iterrows():
  print(s_row)

(0, name    Bob
age      12
Name: 0, dtype: object)
(1, name    Mary
age       39
Name: 1, dtype: object)
(2, name    Roy
age      59
Name: 2, dtype: object)
(3, name    John
age       53
Name: 3, dtype: object)
(4, name    Susie
age        16
Name: 4, dtype: object)

# Addressing Quality Issues

## Addressing Missing Data

[Missing Data User Guide](https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html)

## Addressing Text Data

[Text User Guide](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html)

# Performing Computations

## Multi-Column Computations

In [ ]:
# apply row computations for each row with specifing axis=1
s_magic_number = df_people.apply(lambda s_row : len(s_row["name"]) + s_row["age"], axis=1)

print(type(s_magic_number))
print("")

s_magic_number

<class 'pandas.core.series.Series'>

0    15
1    43
2    62
3    57
4    21
dtype: int64

## Single Column Computations

In [ ]:
s_name_length = df_people.name.apply(lambda single_name : len(single_name))

print(type(s_name_length))
print("")

s_name_length

<class 'pandas.core.series.Series'>

0    3
1    4
2    3
3    4
4    5
Name: name, dtype: int64

In [ ]:
# you can merge series back into data frame since their indexes match

df_people["name_length"] = s_name_length

df_people

    name  age  name_length
0    Bob   12            3
1   Mary   39            4
2    Roy   59            3
3   John   53            4
4  Susie   16            5

# Filtering

## Single Condition Filtering

In [ ]:
df_people_old = df_people[df_people.age > 40]

print(type(df_people_old))
print("")

df_people_old

<class 'pandas.core.frame.DataFrame'>

   name  age
2   Roy   59
3  John   53

## Complex Condition Filtering

In [ ]:
df_people_young_or_roy = df_people[(df_people.age < 40) | (df_people.name == "Roy")]

print(type(df_people_young_or_roy))
print("")

df_people_young_or_roy

<class 'pandas.core.frame.DataFrame'>

    name  age
0    Bob   12
1   Mary   39
2    Roy   59
4  Susie   16

In [ ]:
df_people_young_and_name_longer_than_3_characters = df_people[(df_people.age < 40) & (df_people.name.apply(lambda single_name : len(single_name)) > 3)]

print(type(df_people_young_and_name_longer_than_3_characters))
print("")

df_people_young_and_name_longer_than_3_characters

<class 'pandas.core.frame.DataFrame'>

    name  age
1   Mary   39
4  Susie   16

# Sorting

In [ ]:
df_people_sorted_by_name = df_people.sort_values("name")

print(type(df_people_sorted_by_name))
print("")

df_people_sorted_by_name

<class 'pandas.core.frame.DataFrame'>

    name  age  name_length
0    Bob   12            3
3   John   53            4
1   Mary   39            4
2    Roy   59            3
4  Susie   16            5

In [ ]:
# Notice the original data frame is still unsorted
df_people

    name  age  name_length
0    Bob   12            3
4  Susie   16            5
1   Mary   39            4
3   John   53            4
2    Roy   59            3

In [ ]:
# Specifying inplace to True mutates the DataFrame
df_people.sort_values("age", inplace=True)

df_people
# This avoids using more memory; this can be really important if your dataset is large or your have limited memory in your computer

    name  age  name_length
0    Bob   12            3
4  Susie   16            5
1   Mary   39            4
3   John   53            4
2    Roy   59            3

# Grouping

In [ ]:
g_people = df_people.groupby("name_length")

g_people.mean()

              age
name_length
3            35.5
4            46.0
5            16.0

In [ ]:
g_people.age.max()

name_length
3    59
4    53
5    16
Name: age, dtype: int64

# Merging or Joining

[Merging Joining User Guide](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

# Visualization 

[Chart Visualization User Guide](https://pandas.pydata.org/pandas-docs/stable/user_guide/visualization.html)